package java05_array.array;

public class Array_01 {
	public static void main(String[] args) {
		
		int num; //int형 변수 선언
		num = 123; //int값 대입
		
		//-------------------------
		
		// 배열 선언
		//배열자료형 배열명;
		
		//**배열의 자료형 표현
		// 자료형[]
		
		// ex) int[] - int형 배열
		// ->int형 변수를 여러 개로 나열한 묶음을 만들어 관리
		
		// int형 배열 타입의 변수를 선언
		int[] arr; // 참조형
		
		arr = new int[5]; // 음수 쓰면 에러, 양수값으로 쓰기
		// int형 배열 공간 생성
		// int변수 공간 5개를 만들고 연결
		// 생성된 전체 배열 공간의 첫 주소(참조값)을 반환
		
		// 반환된 주소(참조값)을 arr 배열 변수에 저장
		
		System.out.println("arr의 참조값 : " + arr);
		// 사용 X
		
		//----------------------------------------------------
		
		// 배열을 생성할 때 변수 공간이 묶음으로 한꺼번에 만들어짐
		
		// -> 첫 번째 공간부터 0 번째(인덱스)
		
		arr[0] = 11;
		arr[1] = 22;
		arr[2] = 33;
		arr[3] = 44;
		arr[4] = 55;
		
		//ArrayIndexOutOfBoundsException 예외 상황 발생
		// -> arr배열의 길이(크기)가 5이니까 인덱스 범위는 0 ~ 4
		// -> 인덱스를 5로 접근하면 여섯번째 공간을 찾는 것
		// -> 오류(예외)
//		arr[5] = 66;
		
//		System.out.println(arr[5]);
		
		//-------------------------------------------------
		
		// 반복문을 이용하여 배열의 모든 값 대입
		for(int i = 0; i < 5; i++) {
			arr[i] = (i+1) * 100; // arr[i] 자체를 변수로 이해
		}
		
		// 배열의 모든 값 출력
		for(int i = 0; i < 5; i++) {
			System.out.println(arr[i]);
		}
	}
}
